[
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://purl.org/dc/terms/isPartOf_inv (AND (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_614d38) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_ded8f7))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_614d38> <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x0 .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_ded8f7> .\n?x0 <http://purl.org/dc/terms/isPartOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_614d38>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_ded8f7>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_ded8f7",
                    "class": null,
                    "friendly_name": "Northern California Coast",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_614d38",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool",
                    "friendly_name": "CalEnviroScreen 4.0",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN dcterms:isPartOf_inv (AND (JOIN frbrer:P2007_inv fslp:tol_614d38) (JOIN fsls:inEcoregion fslp:eco_ded8f7))))",
        "s-expression_str": "(AND foaf:Organization (JOIN [contain] (AND (JOIN [create] [CalEnviroScreen 4.0]) (JOIN [in ecoregion] [Northern California Coast]))))",
        "question": "Which organization contains entities that created CalEnviroScreen 4.0 and are in the Northern California Coast ecoregion?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#hasCollaborator https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_1f0971) (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://vivoweb.org/ontology/core#hasCollaborator> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_1f0971> .\n?x <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_1f0971>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070",
                    "class": null,
                    "friendly_name": "Non-profit",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_1f0971",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "CDFW Region 4",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#hasCollaborator",
                    "friendly_name": "has partner"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:hasCollaborator fslp:org_1f0971) (JOIN org:classification fslp:oty_cf5070)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [has partner] [CDFW Region 4]) (JOIN [organization type] [Non-profit])))",
        "question": "Which non-profit organization has CDFW Region 4 as a partner?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_5b271f) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q109709)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_5b271f> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q109709> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <http://www.wikidata.org/entity/Q109709>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_5b271f>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q109709",
                    "class": null,
                    "friendly_name": "Yolo County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_5b271f",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Rubicon Reservoir",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager",
                    "friendly_name": "organization manager"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN fsls:orgManager_inv fslp:inf_5b271f) (JOIN fsls:inCounty http://www.wikidata.org/entity/Q109709)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [manage] [Rubicon Reservoir]) (JOIN [in county] [Yolo County])))",
        "question": "Which organization manages the Rubicon Reservoir and is located in Yolo County?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_789ac1) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_d18c2d)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_789ac1> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_d18c2d> .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_d18c2d>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_789ac1>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_789ac1",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Tahoe Valley West Subbasin",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_d18c2d",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Truckee River",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent",
                    "friendly_name": "adjacent infrastructure"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream",
                    "friendly_name": "downstream infrastructure"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN fsls:infrastructureAdjacent fslp:inf_789ac1) (JOIN fsls:infrastructureDownstream fslp:inf_d18c2d)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN [adjacent infrastructure] [Tahoe Valley West Subbasin]) (JOIN [downstream infrastructure] [Truckee River])))",
        "question": "Which infrastructure is adjacent to the Tahoe Valley West Subbasin and downstream of the Truckee River?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_4ad2ec) (AND (JOIN http://purl.org/dc/terms/isPartOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_30b329) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q108053))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_4ad2ec> <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x .\n?x <http://purl.org/dc/terms/isPartOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_30b329> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q108053> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <http://www.wikidata.org/entity/Q108053>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_4ad2ec>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_30b329>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q108053",
                    "class": null,
                    "friendly_name": "San Bernardino County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_4ad2ec",
                    "class": "http://vivoweb.org/ontology/core#Dataset",
                    "friendly_name": "California Natural Diversity Database",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_30b329",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "CDFW Data and Technology Division",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 3,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN frbrer:P2007_inv fslp:dat_4ad2ec) (AND (JOIN dcterms:isPartOf fslp:org_30b329) (JOIN fsls:inCounty http://www.wikidata.org/entity/Q108053))))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [create] [California Natural Diversity Database]) (AND (JOIN [is part of] [CDFW Data and Technology Division]) (JOIN [in county] [San Bernardino County]))))",
        "question": "Which organization creates the California Natural Diversity Database, is part of the CDFW Data and Technology Division, and is located in San Bernardino County?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN http://purl.obolibrary.org/obo/RO_0002331 (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239 https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301> .\n?x <http://purl.obolibrary.org/obo/RO_0002331> ?x0 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301",
                    "class": null,
                    "friendly_name": "Water Infrastructure",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239",
                    "friendly_name": "related sustainability issue"
                },
                {
                    "start": 2,
                    "end": 1,
                    "relation": "http://purl.obolibrary.org/obo/RO_0002331",
                    "friendly_name": "involved in"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 454,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN obo:RO_0002331 (JOIN fsls:FSI_000239 https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [involved in] (JOIN [related sustainability issue] [Water Infrastructure])))",
        "question": "What infrastructure is involved in issues related to water infrastructure sustainability?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://purl.org/dc/terms/isPartOf_inv (AND (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_a20271) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_446151))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_a20271> <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x0 .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_446151> .\n?x0 <http://purl.org/dc/terms/isPartOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_446151>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_a20271>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_446151",
                    "class": null,
                    "friendly_name": "Northwestern Basin and Range",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_a20271",
                    "class": "http://vivoweb.org/ontology/core#Dataset",
                    "friendly_name": "Wildlife Movement Barrier Priorities",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN dcterms:isPartOf_inv (AND (JOIN frbrer:P2007_inv fslp:dat_a20271) (JOIN fsls:inEcoregion fslp:eco_446151))))",
        "s-expression_str": "(AND foaf:Organization (JOIN [contain] (AND (JOIN [create] [Wildlife Movement Barrier Priorities]) (JOIN [in ecoregion] [Northwestern Basin and Range]))))",
        "question": "Which organization contains entities that create Wildlife Movement Barrier Priorities and are in the Northwestern Basin and Range ecoregion?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q156377)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q156377> .\n?x <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <http://www.wikidata.org/entity/Q156377>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q156377",
                    "class": null,
                    "friendly_name": "Sutter County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 41,
        "s-expression_simplified": "(AND core:Program (JOIN core:affiliatedOrganization (JOIN fsls:inCounty http://www.wikidata.org/entity/Q156377)))",
        "s-expression_str": "(AND core:Program (JOIN [partner organization] (JOIN [in county] [Sutter County])))",
        "question": "Which programs are partnered with organizations located in Sutter County?"
    }
]