[
    {
        "s-expression": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN http://purl.obolibrary.org/obo/RO_0002331 (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_bcefd3))))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_bcefd3> .\n?x <http://purl.obolibrary.org/obo/RO_0002331> ?x0 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_bcefd3>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_bcefd3",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "San Francisco Public Utilities Commission",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg",
                    "friendly_name": "lead organization"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://purl.obolibrary.org/obo/RO_0002331",
                    "friendly_name": "involved in"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "16",
        "s-expression_simplified": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN obo:RO_0002331 (JOIN fsls:leadOrg fslp:org_bcefd3))))",
        "s-expression_str": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [involved in] (JOIN [lead organization] [San Francisco Public Utilities Commission]))))",
        "question": "How many infrastructures are involved in projects led by the San Francisco Public Utilities Commission?"
    },
    {
        "s-expression": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_11cc24) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6)))))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_11cc24> .\n?x1 <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner> ?x1 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_11cc24>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6",
                    "class": null,
                    "friendly_name": "Local Government",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_11cc24",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "South Fork American River",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 3,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                },
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner",
                    "friendly_name": "organization owner"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "1",
        "s-expression_simplified": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN fsls:infrastructureIntersect fslp:inf_11cc24) (JOIN fsls:orgOwner (JOIN org:classification fslp:oty_fceff6)))))",
        "s-expression_str": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN [intersecting infrastructure] [South Fork American River]) (JOIN [organization owner] (JOIN [organization type] [Local Government])))))",
        "question": "How many infrastructure entities intersect with the South Fork American River and are owned by an organization of the type Local Government?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg_inv (JOIN http://purl.obolibrary.org/obo/RO_0002331_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_76708a)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_76708a> <http://purl.obolibrary.org/obo/RO_0002331> ?x0 .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_76708a>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_76708a",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Coachella Canal",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg",
                    "friendly_name": "lead organization"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://purl.obolibrary.org/obo/RO_0002331",
                    "friendly_name": "involved in"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN fsls:leadOrg_inv (JOIN obo:RO_0002331_inv fslp:inf_76708a)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [lead] (JOIN [involve] [Coachella Canal])))",
        "question": "Which organization leads an entity involved with the Coachella Canal?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_345110) (AND (JOIN http://purl.org/dc/terms/isPartOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_e129ca) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_ded8f7))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_345110> <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x .\n?x <http://purl.org/dc/terms/isPartOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_e129ca> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_ded8f7> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_345110>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_e129ca>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_ded8f7>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_ded8f7",
                    "class": null,
                    "friendly_name": "Northern California Coast",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_345110",
                    "class": "http://vivoweb.org/ontology/core#Dataset",
                    "friendly_name": "FMMP Important Farmland Maps",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_e129ca",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "California Department of Conservation",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                }
            ]
        },
        "num_entity": 3,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN frbrer:P2007_inv fslp:dat_345110) (AND (JOIN dcterms:isPartOf fslp:org_e129ca) (JOIN fsls:inEcoregion fslp:eco_ded8f7))))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [create] [FMMP Important Farmland Maps]) (AND (JOIN [is part of] [California Department of Conservation]) (JOIN [in ecoregion] [Northern California Coast]))))",
        "question": "Which organization creates FMMP Important Farmland Maps, is part of the California Department of Conservation, and is located in the Northern California Coast ecoregion?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_747d2b) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_5b9c18))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_747d2b> .\n?x1 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_5b9c18> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager> ?x1 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_5b9c18>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_747d2b>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_5b9c18",
                    "class": null,
                    "friendly_name": "Northern California Coast Ranges",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_747d2b",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "South Fork Eel River",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 3,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                },
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager",
                    "friendly_name": "organization manager"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN fsls:infrastructureIntersect fslp:inf_747d2b) (JOIN fsls:orgManager (JOIN fsls:inEcoregion fslp:eco_5b9c18))))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN [intersecting infrastructure] [South Fork Eel River]) (JOIN [organization manager] (JOIN [in ecoregion] [Northern California Coast Ranges]))))",
        "question": "Which infrastructure intersects with the South Fork Eel River and is managed by an organization located in the Northern California Coast Ranges ecoregion?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Person (JOIN http://xmlns.com/foaf/0.1/name Molly Watkins))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://xmlns.com/foaf/0.1/name> \"Molly Watkins\" .\n?x a <http://xmlns.com/foaf/0.1/Person> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "Molly Watkins",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Person",
                    "class": "http://xmlns.com/foaf/0.1/Person",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://xmlns.com/foaf/0.1/name",
                    "friendly_name": "full name"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Person (JOIN foaf:name Molly Watkins))",
        "s-expression_str": "(AND foaf:Person (JOIN [full name] Molly Watkins))",
        "question": "Who is the person with the full name Molly Watkins?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_8c67b3) (JOIN http://www.w3.org/ns/org#memberOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4d3618)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_8c67b3> <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x .\n?x <http://www.w3.org/ns/org#memberOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4d3618> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4d3618>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_8c67b3>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_8c67b3",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Sardine Meadow Restoration",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4d3618",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "San Gabriel Mountains Community Collaborative",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:affiliatedOrganization_inv fslp:prj_8c67b3) (JOIN org:memberOf fslp:org_4d3618)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [participate in] [Sardine Meadow Restoration]) (JOIN [is member of] [San Gabriel Mountains Community Collaborative])))",
        "question": "Which organization participates in the Sardine Meadow Restoration and is a member of the San Gabriel Mountains Community Collaborative?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_70203b) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa San Joaquin kit fox)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_70203b> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa> \"San Joaquin kit fox\" .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_70203b>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "San Joaquin kit fox",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_70203b",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Pixley National Wildlife Refuge",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager",
                    "friendly_name": "organization manager"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa",
                    "friendly_name": "taxa"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN fsls:orgManager_inv fslp:inf_70203b) (JOIN fsls:taxa San Joaquin kit fox)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [manage] [Pixley National Wildlife Refuge]) (JOIN [taxa] San Joaquin kit fox)))",
        "question": "Which organization manages the Pixley National Wildlife Refuge and is associated with the San Joaquin kit fox?"
    }
]