[
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_941942) (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_941942> <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x .\n?x <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_941942>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6",
                    "class": null,
                    "friendly_name": "Local Government",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_941942",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Knightsen Wetland Restoration and Flood Protection Project",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:affiliatedOrganization_inv fslp:prj_941942) (JOIN org:classification fslp:oty_fceff6)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [participate in] [Knightsen Wetland Restoration and Flood Protection Project]) (JOIN [organization type] [Local Government])))",
        "question": "Which local government organization participates in the Knightsen Wetland Restoration and Flood Protection Project?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#habitatType https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#whr_VRI)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#habitatType> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#whr_VRI> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser> ?x0 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#whr_VRI>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#whr_VRI",
                    "class": null,
                    "friendly_name": "VRI",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser",
                    "friendly_name": "organization user"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#habitatType",
                    "friendly_name": "habitat type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 20,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:orgUser (JOIN fsls:habitatType fslp:whr_VRI)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [organization user] (JOIN [habitat type] [VRI])))",
        "question": "What infrastructure uses an organization that has a habitat type of VRI?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Person (JOIN http://xmlns.com/foaf/0.1/name Jeffery Stackhouse))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://xmlns.com/foaf/0.1/name> \"Jeffery Stackhouse\" .\n?x a <http://xmlns.com/foaf/0.1/Person> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "Jeffery Stackhouse",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Person",
                    "class": "http://xmlns.com/foaf/0.1/Person",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://xmlns.com/foaf/0.1/name",
                    "friendly_name": "full name"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Person (JOIN foaf:name Jeffery Stackhouse))",
        "s-expression_str": "(AND foaf:Person (JOIN [full name] Jeffery Stackhouse))",
        "question": "Who is the person with the full name Jeffery Stackhouse?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_140170)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_140170> .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_140170>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_140170",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Weott Town Area Groundwater Basin",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent",
                    "friendly_name": "adjacent infrastructure"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 3,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:infrastructureIntersect_inv (JOIN fsls:infrastructureAdjacent fslp:inf_140170)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [intersecting infrastructure] (JOIN [adjacent infrastructure] [Weott Town Area Groundwater Basin])))",
        "question": "What infrastructure intersects with the infrastructure adjacent to the Weott Town Area Groundwater Basin?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg (JOIN http://www.w3.org/2004/02/skos/core#altLabel DWR)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://www.w3.org/2004/02/skos/core#altLabel> \"DWR\" .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Project> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "DWR",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg",
                    "friendly_name": "lead organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 2,
        "numerical": false,
        "#results": 27,
        "s-expression_simplified": "(AND core:Project (JOIN fsls:leadOrg (JOIN skos:altLabel DWR)))",
        "s-expression_str": "(AND core:Project (JOIN [lead organization] (JOIN [alias] DWR)))",
        "question": "Which projects are led by the organization known as DWR?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_bd40a2) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa Smith's blue butterfly)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_bd40a2> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa> \"Smith's blue butterfly\" .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_bd40a2>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "Smith's blue butterfly",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_bd40a2",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Monterey Bay",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa",
                    "friendly_name": "taxa"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN fsls:infrastructureIntersect fslp:inf_bd40a2) (JOIN fsls:taxa Smith's blue butterfly)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN [intersecting infrastructure] [Monterey Bay]) (JOIN [taxa] Smith's blue butterfly)))",
        "question": "Which infrastructure intersects Monterey Bay and is associated with the Smith's blue butterfly?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#fundingAgentFor_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_f1b4c3) (JOIN http://purl.obolibrary.org/obo/RO_0000056 https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_1cb0e8)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_f1b4c3> <http://vivoweb.org/ontology/core#fundingAgentFor> ?x .\n?x <http://purl.obolibrary.org/obo/RO_0000056> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_1cb0e8> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_1cb0e8>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_f1b4c3>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_1cb0e8",
                    "class": null,
                    "friendly_name": "Funding",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_f1b4c3",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Mill Bend Conservation Project",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#fundingAgentFor",
                    "friendly_name": "funding organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://purl.obolibrary.org/obo/RO_0000056",
                    "friendly_name": "participates in"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:fundingAgentFor_inv fslp:prj_f1b4c3) (JOIN obo:RO_0000056 fslp:oac_1cb0e8)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [fund] [Mill Bend Conservation Project]) (JOIN [participates in] [Funding])))",
        "question": "Which organization funds the Mill Bend Conservation Project and participates in Funding?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#memberOf_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#assocGeo https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#geo_a8c741)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#assocGeo> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#geo_a8c741> .\n?x0 <http://www.w3.org/ns/org#memberOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#geo_a8c741>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#geo_a8c741",
                    "class": null,
                    "friendly_name": "Lake Tahoe",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#assocGeo",
                    "friendly_name": "associated geography"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 7,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:memberOf_inv (JOIN fsls:assocGeo fslp:geo_a8c741)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [has member] (JOIN [associated geography] [Lake Tahoe])))",
        "question": "Which organization has a member associated with Lake Tahoe?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac",
                    "class": null,
                    "friendly_name": "use case: Sacramento",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg",
                    "friendly_name": "lead organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase",
                    "friendly_name": null
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 224,
        "s-expression_simplified": "(AND core:Program (JOIN fsls:leadOrg (JOIN fsls:usecase fsls:usecaseSac)))",
        "s-expression_str": "(AND core:Program (JOIN [lead organization] (JOIN fsls:usecase [use case: Sacramento])))",
        "question": "Which program is led by an organization that uses the use case from Sacramento?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (JOIN http://vivoweb.org/ontology/core#fundingAgentFor https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_aa925d))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://vivoweb.org/ontology/core#fundingAgentFor> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_aa925d> .\n?x a <http://vivoweb.org/ontology/core#Project> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_aa925d>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_aa925d",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "U.S. Fish and Wildlife Service",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://vivoweb.org/ontology/core#fundingAgentFor",
                    "friendly_name": "funding organization"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 14,
        "s-expression_simplified": "(AND core:Project (JOIN core:fundingAgentFor fslp:org_aa925d))",
        "s-expression_str": "(AND core:Project (JOIN [funding organization] [U.S. Fish and Wildlife Service]))",
        "question": "Which project is funded by the U.S. Fish and Wildlife Service?"
    }
]