[
    {
        "s-expression": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner (JOIN http://www.w3.org/2004/02/skos/core#altLabel SMUD))))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x0 <http://www.w3.org/2004/02/skos/core#altLabel> \"SMUD\" .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner> ?x0 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "SMUD",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner",
                    "friendly_name": "organization owner"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "53",
        "s-expression_simplified": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:orgOwner (JOIN skos:altLabel SMUD))))",
        "s-expression_str": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [organization owner] (JOIN [alias] SMUD))))",
        "question": "How many infrastructures are owned by the organization that is an alias for SMUD?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner (JOIN http://purl.org/dc/terms/isPartOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_282a05)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://purl.org/dc/terms/isPartOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_282a05> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner> ?x0 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_282a05>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_282a05",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "U.S. Department of the Interior",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner",
                    "friendly_name": "organization owner"
                },
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 118,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:orgOwner (JOIN dcterms:isPartOf fslp:org_282a05)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [organization owner] (JOIN [is part of] [U.S. Department of the Interior])))",
        "question": "Which infrastructure is owned by an organization that is part of the U.S. Department of the Interior?"
    },
    {
        "s-expression": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool (JOIN http://purl.org/dc/terms/references Used in Southern California Wetlands Recovery Project))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://purl.org/dc/terms/references> \"Used in Southern California Wetlands Recovery Project\" .\n?x a <http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "Used in Southern California Wetlands Recovery Project",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://purl.org/dc/terms/references",
                    "friendly_name": "references"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool (JOIN dcterms:references Used in Southern California Wetlands Recovery Project))",
        "s-expression_str": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool (JOIN [references] Used in Southern California Wetlands Recovery Project))",
        "question": "Which tool references the use in the Southern California Wetlands Recovery Project?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (AND (JOIN http://purl.obolibrary.org/obo/BFO_0000066_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_db596a) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#progType https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#pgt_1cb0e8)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_db596a> <http://purl.obolibrary.org/obo/BFO_0000066> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#progType> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#pgt_1cb0e8> .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_db596a>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#pgt_1cb0e8>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#pgt_1cb0e8",
                    "class": null,
                    "friendly_name": "Funding",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_db596a",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Sacramento Valley Integrated Regional Water Conservation Plan",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://purl.obolibrary.org/obo/BFO_0000066",
                    "friendly_name": "occurs in"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#progType",
                    "friendly_name": "program type"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND core:Program (AND (JOIN obo:BFO_0000066_inv fslp:prj_db596a) (JOIN fsls:progType fslp:pgt_1cb0e8)))",
        "s-expression_str": "(AND core:Program (AND (JOIN [contain] [Sacramento Valley Integrated Regional Water Conservation Plan]) (JOIN [program type] [Funding])))",
        "question": "Which program contains the Sacramento Valley Integrated Regional Water Conservation Plan and is of the type Funding?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q108067)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q108067> .\n?x <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <http://www.wikidata.org/entity/Q108067>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q108067",
                    "class": null,
                    "friendly_name": "Sonoma County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 42,
        "s-expression_simplified": "(AND core:Program (JOIN core:affiliatedOrganization (JOIN fsls:inCounty http://www.wikidata.org/entity/Q108067)))",
        "s-expression_str": "(AND core:Program (JOIN [partner organization] (JOIN [in county] [Sonoma County])))",
        "question": "Which programs are partnered with organizations in Sonoma County?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239 https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0158))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0158> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0158>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0158",
                    "class": null,
                    "friendly_name": "Irrigation",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239",
                    "friendly_name": "related sustainability issue"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 134,
        "s-expression_simplified": "(AND foaf:Organization (JOIN fsls:FSI_000239 https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0158))",
        "s-expression_str": "(AND foaf:Organization (JOIN [related sustainability issue] [Irrigation]))",
        "question": "Which organization is associated with the sustainability issue of irrigation?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa waterfowl)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa> \"waterfowl\" .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager> ?x0 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "waterfowl",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager",
                    "friendly_name": "organization manager"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa",
                    "friendly_name": "taxa"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 2,
        "numerical": false,
        "#results": 3,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:orgManager (JOIN fsls:taxa waterfowl)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [organization manager] (JOIN [taxa] waterfowl)))",
        "question": "What infrastructure is managed by an organization that manages waterfowl taxa?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_f059a5) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_35bcd0)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_f059a5> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_35bcd0> .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_35bcd0>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_f059a5>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_35bcd0",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "Yolo County Flood Control and Water Conservation District",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_f059a5",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Cache Creek",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                },
                {
                    "start": 0,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager",
                    "friendly_name": "organization manager"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 2,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN fsls:infrastructureIntersect fslp:inf_f059a5) (JOIN fsls:orgManager fslp:org_35bcd0)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN [intersecting infrastructure] [Cache Creek]) (JOIN [organization manager] [Yolo County Flood Control and Water Conservation District])))",
        "question": "What infrastructure intersects with Cache Creek and is managed by the Yolo County Flood Control and Water Conservation District?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#fundingAgentFor_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_8ec265) (JOIN http://www.w3.org/2004/02/skos/core#altLabel CAL FIRE)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_8ec265> <http://vivoweb.org/ontology/core#fundingAgentFor> ?x .\n?x <http://www.w3.org/2004/02/skos/core#altLabel> \"CAL FIRE\" .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_8ec265>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "CAL FIRE",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_8ec265",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Los Padres Strategic Community Fuelbreak Collaborative Project",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#fundingAgentFor",
                    "friendly_name": "funding organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:fundingAgentFor_inv fslp:prj_8ec265) (JOIN skos:altLabel CAL FIRE)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [fund] [Los Padres Strategic Community Fuelbreak Collaborative Project]) (JOIN [alias] CAL FIRE)))",
        "question": "Which organization, also known as CAL FIRE, funds the Los Padres Strategic Community Fuelbreak Collaborative Project?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_7196de))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_7196de> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_7196de>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_7196de",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Merced River",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureAdjacent",
                    "friendly_name": "adjacent infrastructure"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:infrastructureAdjacent_inv fslp:inf_7196de))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [adjacent infrastructure] [Merced River]))",
        "question": "Which infrastructure is adjacent to the Merced River?"
    }
]