[
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_5c3e22) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_5c3e22> <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_5c3e22>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac",
                    "class": null,
                    "friendly_name": "use case: Sacramento",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_5c3e22",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Climate Smart Restoration at River Garden Farms",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase",
                    "friendly_name": null
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 3,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:affiliatedOrganization_inv fslp:prj_5c3e22) (JOIN fsls:usecase fsls:usecaseSac)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [participate in] [Climate Smart Restoration at River Garden Farms]) (JOIN fsls:usecase [use case: Sacramento])))",
        "question": "Which organization participates in the Climate Smart Restoration at River Garden Farms and uses the use case for Sacramento?"
    },
    {
        "s-expression": "(COUNT (AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#memberOf_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac))))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac> .\n?x0 <http://www.w3.org/ns/org#memberOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac",
                    "class": null,
                    "friendly_name": "use case: Sacramento",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase",
                    "friendly_name": null
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "114",
        "s-expression_simplified": "(COUNT (AND foaf:Organization (JOIN org:memberOf_inv (JOIN fsls:usecase fsls:usecaseSac))))",
        "s-expression_str": "(COUNT (AND foaf:Organization (JOIN [has member] (JOIN fsls:usecase [use case: Sacramento]))))",
        "question": "How many organizations have a member involved in the use case of Sacramento?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (AND (JOIN http://purl.obolibrary.org/obo/BFO_0000066_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_f59863) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q109705)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_f59863> <http://purl.obolibrary.org/obo/BFO_0000066> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q109705> .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_f59863>)\nFILTER (?x != <http://www.wikidata.org/entity/Q109705>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q109705",
                    "class": null,
                    "friendly_name": "Tehama County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_f59863",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Santa Cruz County RCIS",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://purl.obolibrary.org/obo/BFO_0000066",
                    "friendly_name": "occurs in"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND core:Program (AND (JOIN obo:BFO_0000066_inv fslp:prj_f59863) (JOIN fsls:inCounty http://www.wikidata.org/entity/Q109705)))",
        "s-expression_str": "(AND core:Program (AND (JOIN [contain] [Santa Cruz County RCIS]) (JOIN [in county] [Tehama County])))",
        "question": "Which program contains the Santa Cruz County RCIS and is in Tehama County?"
    },
    {
        "s-expression": "(COUNT (AND http://xmlns.com/foaf/0.1/Organization (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_c045d8)))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_c045d8> <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_c045d8>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_c045d8",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool",
                    "friendly_name": "San Joaquin Valley Project Prioritization Tool",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "1",
        "s-expression_simplified": "(COUNT (AND foaf:Organization (JOIN frbrer:P2007_inv fslp:tol_c045d8)))",
        "s-expression_str": "(COUNT (AND foaf:Organization (JOIN [create] [San Joaquin Valley Project Prioritization Tool])))",
        "question": "How many organizations create the San Joaquin Valley Project Prioritization Tool?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_be97a2) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity 1100 acres)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_be97a2> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity> \"1100 acres\" .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_be97a2>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "1100 acres",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_be97a2",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Bolinas Lagoon Preserve",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity",
                    "friendly_name": "capacity"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN fsls:infrastructureIntersect fslp:inf_be97a2) (JOIN fsls:hasCapacity 1100 acres)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN [intersecting infrastructure] [Bolinas Lagoon Preserve]) (JOIN [capacity] 1100 acres)))",
        "question": "What infrastructure intersects with the Bolinas Lagoon Preserve and has a capacity of 1100 acres?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#memberOf_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac> .\n?x0 <http://www.w3.org/ns/org#memberOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac",
                    "class": null,
                    "friendly_name": "use case: Sacramento",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase",
                    "friendly_name": null
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 114,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:memberOf_inv (JOIN fsls:usecase fsls:usecaseSac)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [has member] (JOIN fsls:usecase [use case: Sacramento])))",
        "question": "Which organization has a member that uses the use case related to Sacramento?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa green sturgeon))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa> \"green sturgeon\" .\n?x a <http://vivoweb.org/ontology/core#Project> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "green sturgeon",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa",
                    "friendly_name": "taxa"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 1,
        "numerical": false,
        "#results": 3,
        "s-expression_simplified": "(AND core:Project (JOIN fsls:taxa green sturgeon))",
        "s-expression_str": "(AND core:Project (JOIN [taxa] green sturgeon))",
        "question": "Which project involves the green sturgeon taxa?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Person (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSCAG))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSCAG> .\n?x a <http://xmlns.com/foaf/0.1/Person> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSCAG>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSCAG",
                    "class": null,
                    "friendly_name": "use case: SCAG",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Person",
                    "class": "http://xmlns.com/foaf/0.1/Person",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase",
                    "friendly_name": null
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 104,
        "s-expression_simplified": "(AND foaf:Person (JOIN fsls:usecase fsls:usecaseSCAG))",
        "s-expression_str": "(AND foaf:Person (JOIN fsls:usecase [use case: SCAG]))",
        "question": "Which person uses the SCAG use case?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (AND (JOIN http://www.w3.org/2004/02/skos/core#altLabel Cadiz Valley Water Conservation, Recovery and Storage Project) (JOIN http://purl.obolibrary.org/obo/RO_0002331_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_d107fa)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://www.w3.org/2004/02/skos/core#altLabel> \"Cadiz Valley Water Conservation, Recovery and Storage Project\" .\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_d107fa> <http://purl.obolibrary.org/obo/RO_0002331> ?x .\n?x a <http://vivoweb.org/ontology/core#Project> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_d107fa>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "Cadiz Valley Water Conservation, Recovery and Storage Project",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_d107fa",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Northern Pipeline",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                },
                {
                    "start": 2,
                    "end": 1,
                    "relation": "http://purl.obolibrary.org/obo/RO_0002331",
                    "friendly_name": "involved in"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND core:Project (AND (JOIN skos:altLabel Cadiz Valley Water Conservation, Recovery and Storage Project) (JOIN obo:RO_0002331_inv fslp:inf_d107fa)))",
        "s-expression_str": "(AND core:Project (AND (JOIN [alias] Cadiz Valley Water Conservation, Recovery and Storage Project) (JOIN [involve] [Northern Pipeline])))",
        "question": "Which project, also known as the Cadiz Valley Water Conservation, Recovery and Storage Project, involves the Northern Pipeline?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bac588) (JOIN http://purl.obolibrary.org/obo/RO_0000056 https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_a9771f)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bac588> <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x .\n?x <http://purl.obolibrary.org/obo/RO_0000056> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_a9771f> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bac588>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_a9771f>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_a9771f",
                    "class": null,
                    "friendly_name": "Acquisition",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bac588",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": "Tahoe-Central Sierra Initiative",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://purl.obolibrary.org/obo/RO_0000056",
                    "friendly_name": "participates in"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 2,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:affiliatedOrganization_inv fslp:prg_bac588) (JOIN obo:RO_0000056 fslp:oac_a9771f)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [participate in] [Tahoe-Central Sierra Initiative]) (JOIN [participates in] [Acquisition])))",
        "question": "Which organization participates in both the Tahoe-Central Sierra Initiative and Acquisition?"
    }
]