[
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bac588) (JOIN http://purl.obolibrary.org/obo/RO_0000056 https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_59fbdc)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bac588> <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x .\n?x <http://purl.obolibrary.org/obo/RO_0000056> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_59fbdc> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bac588>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_59fbdc>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_59fbdc",
                    "class": null,
                    "friendly_name": "Education",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bac588",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": "Tahoe-Central Sierra Initiative",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://purl.obolibrary.org/obo/RO_0000056",
                    "friendly_name": "participates in"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 3,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:affiliatedOrganization_inv fslp:prg_bac588) (JOIN obo:RO_0000056 fslp:oac_59fbdc)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [participate in] [Tahoe-Central Sierra Initiative]) (JOIN [participates in] [Education])))",
        "question": "Which organization participates in both the Tahoe-Central Sierra Initiative and Education?"
    },
    {
        "s-expression": "(COUNT (AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://www.w3.org/ns/org#memberOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_589b2b) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa birds))))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x <http://www.w3.org/ns/org#memberOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_589b2b> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa> \"birds\" .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_589b2b>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "birds",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_589b2b",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "Bay Area Audubon Council",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa",
                    "friendly_name": "taxa"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "1",
        "s-expression_simplified": "(COUNT (AND foaf:Organization (AND (JOIN org:memberOf fslp:org_589b2b) (JOIN fsls:taxa birds))))",
        "s-expression_str": "(COUNT (AND foaf:Organization (AND (JOIN [is member of] [Bay Area Audubon Council]) (JOIN [taxa] birds))))",
        "question": "How many organizations are members of the Bay Area Audubon Council and are associated with birds?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://purl.org/dc/terms/isPartOf_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_cc0a29)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_cc0a29> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner> ?x0 .\n?x0 <http://purl.org/dc/terms/isPartOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_cc0a29>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_cc0a29",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Cordelia Pumping Plant",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner",
                    "friendly_name": "organization owner"
                },
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN dcterms:isPartOf_inv (JOIN fsls:orgOwner_inv fslp:inf_cc0a29)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [contain] (JOIN [own] [Cordelia Pumping Plant])))",
        "question": "Which organization owns the Cordelia Pumping Plant and contains it?"
    },
    {
        "s-expression": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#mandatedBy_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_847f7d) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q156188)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_847f7d> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#mandatedBy> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q156188> .\n?x a <http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates> .\nFILTER (?x != <http://www.wikidata.org/entity/Q156188>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_847f7d>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q156188",
                    "class": null,
                    "friendly_name": "Trinity County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#dat_847f7d",
                    "class": "http://vivoweb.org/ontology/core#Dataset",
                    "friendly_name": "Big-Game SO3362 Focus Areas",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#mandatedBy",
                    "friendly_name": "mandated by"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (AND (JOIN fsls:mandatedBy_inv fslp:dat_847f7d) (JOIN fsls:inCounty http://www.wikidata.org/entity/Q156188)))",
        "s-expression_str": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (AND (JOIN [mandate] [Big-Game SO3362 Focus Areas]) (JOIN [in county] [Trinity County])))",
        "question": "Which best practices and mandates are mandated for Big-Game SO3362 Focus Areas and are within Trinity County?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa coho salmon)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa> \"coho salmon\" .\n?x <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Program> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "coho salmon",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa",
                    "friendly_name": "taxa"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 2,
        "numerical": false,
        "#results": 2,
        "s-expression_simplified": "(AND core:Program (JOIN core:affiliatedOrganization (JOIN fsls:taxa coho salmon)))",
        "s-expression_str": "(AND core:Program (JOIN [partner organization] (JOIN [taxa] coho salmon)))",
        "question": "Which programs are partnered with organizations that focus on the coho salmon taxa?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070",
                    "class": null,
                    "friendly_name": "Non-profit",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 618,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:classification fslp:oty_cf5070))",
        "s-expression_str": "(AND foaf:Organization (JOIN [organization type] [Non-profit]))",
        "question": "Which organizations are classified as non-profit?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureType https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#ift_f4b531)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureType> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#ift_f4b531> .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#ift_f4b531>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#ift_f4b531",
                    "class": null,
                    "friendly_name": "Water - Water Pipeline",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream",
                    "friendly_name": "upstream infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureType",
                    "friendly_name": "infrastructure type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 78,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:infrastructureUpstream_inv (JOIN fsls:infrastructureType fslp:ift_f4b531)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [is upstream infrastructure of] (JOIN [infrastructure type] [Water - Water Pipeline])))",
        "question": "What infrastructure is upstream of a water pipeline infrastructure type?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (JOIN http://vivoweb.org/ontology/core#fundingAgentFor (JOIN http://purl.obolibrary.org/obo/RO_0000056 https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_7c7648)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://purl.obolibrary.org/obo/RO_0000056> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_7c7648> .\n?x <http://vivoweb.org/ontology/core#fundingAgentFor> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Project> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_7c7648>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_7c7648",
                    "class": null,
                    "friendly_name": "Regulating",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#fundingAgentFor",
                    "friendly_name": "funding organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://purl.obolibrary.org/obo/RO_0000056",
                    "friendly_name": "participates in"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 26,
        "s-expression_simplified": "(AND core:Project (JOIN core:fundingAgentFor (JOIN obo:RO_0000056 fslp:oac_7c7648)))",
        "s-expression_str": "(AND core:Project (JOIN [funding organization] (JOIN [participates in] [Regulating])))",
        "question": "Which project is funded by an organization that participates in regulating?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_fd13b8))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_fd13b8> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_fd13b8>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_fd13b8",
                    "class": null,
                    "friendly_name": "Modoc Plateau",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 456,
        "s-expression_simplified": "(AND foaf:Organization (JOIN fsls:inEcoregion fslp:eco_fd13b8))",
        "s-expression_str": "(AND foaf:Organization (JOIN [in ecoregion] [Modoc Plateau]))",
        "question": "Which organization is located in the Modoc Plateau ecoregion?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization (AND (JOIN http://purl.org/dc/terms/isPartOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_78a599) (JOIN http://www.w3.org/2004/02/skos/core#altLabel California Department of Transportation))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://purl.org/dc/terms/isPartOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_78a599> .\n?x0 <http://www.w3.org/2004/02/skos/core#altLabel> \"California Department of Transportation\" .\n?x <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Project> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_78a599>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "California Department of Transportation",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_78a599",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "California State Transportation Agency",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 3,
        "numerical": false,
        "#results": 6,
        "s-expression_simplified": "(AND core:Project (JOIN core:affiliatedOrganization (AND (JOIN dcterms:isPartOf fslp:org_78a599) (JOIN skos:altLabel California Department of Transportation))))",
        "s-expression_str": "(AND core:Project (JOIN [partner organization] (AND (JOIN [is part of] [California State Transportation Agency]) (JOIN [alias] California Department of Transportation))))",
        "question": "Which projects have a partner organization that is part of the California State Transportation Agency and is also known as the California Department of Transportation?"
    }
]