[
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_11e3fb))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_11e3fb> .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_11e3fb>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_11e3fb",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "Sacramento Municipal Utilities District",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager",
                    "friendly_name": "organization manager"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 56,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:orgManager fslp:org_11e3fb))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [organization manager] [Sacramento Municipal Utilities District]))",
        "question": "Which infrastructure is managed by the Sacramento Municipal Utilities District?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#fundingAgentFor_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_509f28) (JOIN http://purl.obolibrary.org/obo/RO_0000056 https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_1cb0e8)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_509f28> <http://vivoweb.org/ontology/core#fundingAgentFor> ?x .\n?x <http://purl.obolibrary.org/obo/RO_0000056> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_1cb0e8> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_509f28>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_1cb0e8>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_1cb0e8",
                    "class": null,
                    "friendly_name": "Funding",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_509f28",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Laguna Middle Reach Restoration Project",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#fundingAgentFor",
                    "friendly_name": "funding organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://purl.obolibrary.org/obo/RO_0000056",
                    "friendly_name": "participates in"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 3,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:fundingAgentFor_inv fslp:prj_509f28) (JOIN obo:RO_0000056 fslp:oac_1cb0e8)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [fund] [Laguna Middle Reach Restoration Project]) (JOIN [participates in] [Funding])))",
        "question": "Which organization funds the Laguna Middle Reach Restoration Project and participates in Funding?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_422462) (JOIN http://www.w3.org/2004/02/skos/core#altLabel USBR)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_422462> <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x .\n?x <http://www.w3.org/2004/02/skos/core#altLabel> \"USBR\" .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_422462>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "USBR",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_422462",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": "Walker Basin Restoration Program",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:affiliatedOrganization_inv fslp:prg_422462) (JOIN skos:altLabel USBR)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [participate in] [Walker Basin Restoration Program]) (JOIN [alias] USBR)))",
        "question": "Which organization, also known as USBR, participates in the Walker Basin Restoration Program?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41",
                    "class": null,
                    "friendly_name": "Federal Government",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 166,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:classification fslp:oty_bc6b41))",
        "s-expression_str": "(AND foaf:Organization (JOIN [organization type] [Federal Government]))",
        "question": "Which organizations are types of Federal Government?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#memberOf_inv (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_31c786) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q109686))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_31c786> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser> ?x0 .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q109686> .\n?x0 <http://www.w3.org/ns/org#memberOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_31c786>)\nFILTER (?x != <http://www.wikidata.org/entity/Q109686>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q109686",
                    "class": null,
                    "friendly_name": "Tulare County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_31c786",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Cross Valley Canal",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser",
                    "friendly_name": "organization user"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 3,
        "numerical": false,
        "#results": 14,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:memberOf_inv (AND (JOIN fsls:orgUser_inv fslp:inf_31c786) (JOIN fsls:inCounty http://www.wikidata.org/entity/Q109686))))",
        "s-expression_str": "(AND foaf:Organization (JOIN [has member] (AND (JOIN [use] [Cross Valley Canal]) (JOIN [in county] [Tulare County]))))",
        "question": "Which organization has a member that uses the Cross Valley Canal and is in Tulare County?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_7dfa16))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_7dfa16> .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_7dfa16>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_7dfa16",
                    "class": null,
                    "friendly_name": "Great Valley",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 207,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:inEcoregion fslp:eco_7dfa16))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [in ecoregion] [Great Valley]))",
        "question": "What infrastructure is in the Great Valley ecoregion?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_2e64a3) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0321)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_2e64a3> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0321> .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0321>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_2e64a3>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0321",
                    "class": null,
                    "friendly_name": "Riparian Habitats",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_2e64a3",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Death Valley National Park",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose",
                    "friendly_name": "purpose of infrastructure"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN fsls:infrastructureIntersect fslp:inf_2e64a3) (JOIN fsls:issuesPurpose https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0321)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN [intersecting infrastructure] [Death Valley National Park]) (JOIN [purpose of infrastructure] [Riparian Habitats])))",
        "question": "What infrastructure intersects with Death Valley National Park and serves the purpose of supporting Riparian Habitats?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser (JOIN http://www.w3.org/2004/02/skos/core#altLabel GCID)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://www.w3.org/2004/02/skos/core#altLabel> \"GCID\" .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser> ?x0 .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "GCID",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgUser",
                    "friendly_name": "organization user"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 2,
        "numerical": false,
        "#results": 4,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:orgUser (JOIN skos:altLabel GCID)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [organization user] (JOIN [alias] GCID)))",
        "question": "What infrastructure is used by the organization that has the alias GCID?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://purl.org/dc/terms/isPartOf_inv (JOIN http://www.w3.org/2004/02/skos/core#altLabel JMIE, John Muir Institute of the Environment)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://www.w3.org/2004/02/skos/core#altLabel> \"JMIE, John Muir Institute of the Environment\" .\n?x0 <http://purl.org/dc/terms/isPartOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "JMIE, John Muir Institute of the Environment",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN dcterms:isPartOf_inv (JOIN skos:altLabel JMIE, John Muir Institute of the Environment)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [contain] (JOIN [alias] JMIE, John Muir Institute of the Environment)))",
        "question": "Which organization contains an entity that is an alias for JMIE or the John Muir Institute of the Environment?"
    },
    {
        "s-expression": "(COUNT (AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://www.w3.org/ns/org#memberOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_915458) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa California condor))))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x <http://www.w3.org/ns/org#memberOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_915458> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa> \"California condor\" .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_915458>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "California condor",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_915458",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "California Central Coast Joint Venture",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#taxa",
                    "friendly_name": "taxa"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "1",
        "s-expression_simplified": "(COUNT (AND foaf:Organization (AND (JOIN org:memberOf fslp:org_915458) (JOIN fsls:taxa California condor))))",
        "s-expression_str": "(COUNT (AND foaf:Organization (AND (JOIN [is member of] [California Central Coast Joint Venture]) (JOIN [taxa] California condor))))",
        "question": "How many organizations are members of the California Central Coast Joint Venture and are associated with the California condor?"
    }
]