[
    {
        "s-expression": "(COUNT (AND http://xmlns.com/foaf/0.1/Organization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_a4e282)))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_a4e282> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_a4e282>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_a4e282",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": "Land and Water Conservation Fund",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#leadOrg",
                    "friendly_name": "lead organization"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "1",
        "s-expression_simplified": "(COUNT (AND foaf:Organization (JOIN fsls:leadOrg_inv fslp:prg_a4e282)))",
        "s-expression_str": "(COUNT (AND foaf:Organization (JOIN [lead] [Land and Water Conservation Fund])))",
        "question": "How many organizations lead the Land and Water Conservation Fund?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureType https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#ift_94d65d)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureType> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#ift_94d65d> .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#ift_94d65d>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#ift_94d65d",
                    "class": null,
                    "friendly_name": "Water - Water Retention Structure",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream",
                    "friendly_name": "downstream infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureType",
                    "friendly_name": "infrastructure type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 160,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:infrastructureDownstream_inv (JOIN fsls:infrastructureType fslp:ift_94d65d)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [is downstream infrastructure of] (JOIN [infrastructure type] [Water - Water Retention Structure])))",
        "question": "What infrastructure is downstream of any structure classified as a Water - Water Retention Structure?"
    },
    {
        "s-expression": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN http://www.w3.org/2004/02/skos/core#altLabel Hodges Reservoir)))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x <http://www.w3.org/2004/02/skos/core#altLabel> \"Hodges Reservoir\" .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "Hodges Reservoir",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 0,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "1",
        "s-expression_simplified": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN skos:altLabel Hodges Reservoir)))",
        "s-expression_str": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [alias] Hodges Reservoir)))",
        "question": "How many infrastructures are known by the alias Hodges Reservoir?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (JOIN http://vivoweb.org/ontology/core#hasFundingVehicle https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_b79b63))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://vivoweb.org/ontology/core#hasFundingVehicle> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_b79b63> .\n?x a <http://vivoweb.org/ontology/core#Project> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_b79b63>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_b79b63",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": "Forest Conservation Program",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://vivoweb.org/ontology/core#hasFundingVehicle",
                    "friendly_name": "funding provided via"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 8,
        "s-expression_simplified": "(AND core:Project (JOIN core:hasFundingVehicle fslp:prg_b79b63))",
        "s-expression_str": "(AND core:Project (JOIN [funding provided via] [Forest Conservation Program]))",
        "question": "Which projects are funded via the Forest Conservation Program?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_d618a6))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_d618a6> <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_d618a6>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_d618a6",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool",
                    "friendly_name": "CaRPE Tool",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN frbrer:P2007_inv fslp:tol_d618a6))",
        "s-expression_str": "(AND foaf:Organization (JOIN [create] [CaRPE Tool]))",
        "question": "Which organization creates the CaRPE Tool?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://purl.org/dc/terms/isPartOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_23ce12) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q156350)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://purl.org/dc/terms/isPartOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_23ce12> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q156350> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <http://www.wikidata.org/entity/Q156350>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_23ce12>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q156350",
                    "class": null,
                    "friendly_name": "Shasta County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_23ce12",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "UCR College of Natural and Agricultural Sciences",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 2,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN dcterms:isPartOf fslp:org_23ce12) (JOIN fsls:inCounty http://www.wikidata.org/entity/Q156350)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [is part of] [UCR College of Natural and Agricultural Sciences]) (JOIN [in county] [Shasta County])))",
        "question": "Which organization is part of the UCR College of Natural and Agricultural Sciences and located in Shasta County?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#memberOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_168b87))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://www.w3.org/ns/org#memberOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_168b87> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_168b87>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_168b87",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "Smith River Collaborative",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 8,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:memberOf fslp:org_168b87))",
        "s-expression_str": "(AND foaf:Organization (JOIN [is member of] [Smith River Collaborative]))",
        "question": "Which organization is a member of the Smith River Collaborative?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q104994))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q104994> .\n?x a <http://vivoweb.org/ontology/core#Project> .\nFILTER (?x != <http://www.wikidata.org/entity/Q104994>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q104994",
                    "class": null,
                    "friendly_name": "Los Angeles County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 42,
        "s-expression_simplified": "(AND core:Project (JOIN fsls:inCounty http://www.wikidata.org/entity/Q104994))",
        "s-expression_str": "(AND core:Project (JOIN [in county] [Los Angeles County]))",
        "question": "What projects are in Los Angeles County?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (AND (JOIN http://purl.obolibrary.org/obo/RO_0002331_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_1d1590) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#progType https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#pgt_441396)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_1d1590> <http://purl.obolibrary.org/obo/RO_0002331> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#progType> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#pgt_441396> .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#pgt_441396>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_1d1590>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#pgt_441396",
                    "class": null,
                    "friendly_name": "Management",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_1d1590",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Kern County Subbasin",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://purl.obolibrary.org/obo/RO_0002331",
                    "friendly_name": "involved in"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#progType",
                    "friendly_name": "program type"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 2,
        "s-expression_simplified": "(AND core:Program (AND (JOIN obo:RO_0002331_inv fslp:inf_1d1590) (JOIN fsls:progType fslp:pgt_441396)))",
        "s-expression_str": "(AND core:Program (AND (JOIN [involve] [Kern County Subbasin]) (JOIN [program type] [Management])))",
        "question": "Which program involves the Kern County Subbasin and is of the type Management?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bb0efc) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bb0efc> <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bb0efc>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac",
                    "class": null,
                    "friendly_name": "use case: Sacramento",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prg_bb0efc",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": "Bring Back the Native Fish",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase",
                    "friendly_name": null
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 2,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:affiliatedOrganization_inv fslp:prg_bb0efc) (JOIN fsls:usecase fsls:usecaseSac)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [participate in] [Bring Back the Native Fish]) (JOIN fsls:usecase [use case: Sacramento])))",
        "question": "Which organization participates in 'Bring Back the Native Fish' and is associated with the use case in Sacramento?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#GM_Name (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q108058)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q108058> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#GM_Name> ?x0 .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <http://www.wikidata.org/entity/Q108058>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q108058",
                    "class": null,
                    "friendly_name": "Contra Costa County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                },
                {
                    "start": 2,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#GM_Name",
                    "friendly_name": "guideline/mandate name"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN fsls:GM_Name (JOIN fsls:inCounty http://www.wikidata.org/entity/Q108058)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [guideline/mandate name] (JOIN [in county] [Contra Costa County])))",
        "question": "Which organization is associated with a guideline or mandate that is applicable in Contra Costa County?"
    }
]