[
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#isPartOfInfra_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301> .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#isPartOfInfra> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301",
                    "class": null,
                    "friendly_name": "Water Infrastructure",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#isPartOfInfra",
                    "friendly_name": "is part of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose",
                    "friendly_name": "purpose of infrastructure"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 40,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:isPartOfInfra_inv (JOIN fsls:issuesPurpose https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0301)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [contain] (JOIN [purpose of infrastructure] [Water Infrastructure])))",
        "question": "What infrastructure contains elements that are purposed for water infrastructure?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_b14e38))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_b14e38> <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_b14e38>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#tol_b14e38",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#Tool",
                    "friendly_name": "Nitrate Groundwater Pollution Hazard Index",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN frbrer:P2007_inv fslp:tol_b14e38))",
        "s-expression_str": "(AND foaf:Organization (JOIN [create] [Nitrate Groundwater Pollution Hazard Index]))",
        "question": "Which organization created the Nitrate Groundwater Pollution Hazard Index?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream_inv (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_43de3f) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity 400 AF))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_43de3f> .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity> \"400 AF\" .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_43de3f>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "400 AF",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_43de3f",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Don Pedro Powerhouse",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream",
                    "friendly_name": "downstream infrastructure"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream",
                    "friendly_name": "upstream infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity",
                    "friendly_name": "capacity"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:infrastructureDownstream_inv (AND (JOIN fsls:infrastructureUpstream fslp:inf_43de3f) (JOIN fsls:hasCapacity 400 AF))))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [is downstream infrastructure of] (AND (JOIN [upstream infrastructure] [Don Pedro Powerhouse]) (JOIN [capacity] 400 AF))))",
        "question": "What infrastructure is downstream of an entity that is both upstream of the Don Pedro Powerhouse and has a capacity of 400 acre-feet?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#memberOf_inv (JOIN http://vivoweb.org/ontology/core#hasCollaborator https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4a4578)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://vivoweb.org/ontology/core#hasCollaborator> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4a4578> .\n?x0 <http://www.w3.org/ns/org#memberOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4a4578>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4a4578",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "Environmental Defense Center",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#hasCollaborator",
                    "friendly_name": "has partner"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:memberOf_inv (JOIN core:hasCollaborator fslp:org_4a4578)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [has member] (JOIN [has partner] [Environmental Defense Center])))",
        "question": "Which organization has a member that is a partner of the Environmental Defense Center?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (AND (JOIN http://purl.obolibrary.org/obo/RO_0002331_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_9ab657) (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_6a7417))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_9ab657> <http://purl.obolibrary.org/obo/RO_0002331> ?x .\n?x1 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_6a7417> .\n?x <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x1 .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_9ab657>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_6a7417>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_6a7417",
                    "class": null,
                    "friendly_name": "Southern Cascades",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_9ab657",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Eastern San Joaquin Subbasin",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://purl.obolibrary.org/obo/RO_0002331",
                    "friendly_name": "involved in"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 3,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND core:Program (AND (JOIN obo:RO_0002331_inv fslp:inf_9ab657) (JOIN core:affiliatedOrganization (JOIN fsls:inEcoregion fslp:eco_6a7417))))",
        "s-expression_str": "(AND core:Program (AND (JOIN [involve] [Eastern San Joaquin Subbasin]) (JOIN [partner organization] (JOIN [in ecoregion] [Southern Cascades]))))",
        "question": "Which program involves the Eastern San Joaquin Subbasin and has a partner organization in the Southern Cascades ecoregion?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#GM_Name (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_446151)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_446151> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#GM_Name> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_446151>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_446151",
                    "class": null,
                    "friendly_name": "Northwestern Basin and Range",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                },
                {
                    "start": 2,
                    "end": 1,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#GM_Name",
                    "friendly_name": "guideline/mandate name"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 55,
        "s-expression_simplified": "(AND core:Program (JOIN fsls:GM_Name (JOIN fsls:inEcoregion fslp:eco_446151)))",
        "s-expression_str": "(AND core:Program (JOIN [guideline/mandate name] (JOIN [in ecoregion] [Northwestern Basin and Range])))",
        "question": "Which program is guided or mandated in the Northwestern Basin and Range ecoregion?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://www.w3.org/ns/org#memberOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_682af8) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q109705)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://www.w3.org/ns/org#memberOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_682af8> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q109705> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_682af8>)\nFILTER (?x != <http://www.wikidata.org/entity/Q109705>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q109705",
                    "class": null,
                    "friendly_name": "Tehama County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_682af8",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "California Plant Rescue",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 7,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN org:memberOf fslp:org_682af8) (JOIN fsls:inCounty http://www.wikidata.org/entity/Q109705)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [is member of] [California Plant Rescue]) (JOIN [in county] [Tehama County])))",
        "question": "Which organization is a member of the California Plant Rescue and is located in Tehama County?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#memberOf_inv (JOIN http://purl.obolibrary.org/obo/RO_0000056 https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_3e7a73)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://purl.obolibrary.org/obo/RO_0000056> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_3e7a73> .\n?x0 <http://www.w3.org/ns/org#memberOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_3e7a73>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oac_3e7a73",
                    "class": null,
                    "friendly_name": "Advocacy",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://purl.obolibrary.org/obo/RO_0000056",
                    "friendly_name": "participates in"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 44,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:memberOf_inv (JOIN obo:RO_0000056 fslp:oac_3e7a73)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [has member] (JOIN [participates in] [Advocacy])))",
        "question": "Which organization has a member that participates in Advocacy?"
    },
    {
        "s-expression": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239 https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0016))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0016> .\n?x a <http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0016>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0016",
                    "class": null,
                    "friendly_name": "Agricultural Prices",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239",
                    "friendly_name": "related sustainability issue"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 2,
        "s-expression_simplified": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (JOIN fsls:FSI_000239 https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0016))",
        "s-expression_str": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (JOIN [related sustainability issue] [Agricultural Prices]))",
        "question": "What best practices and mandates are related to the sustainability issue of Agricultural Prices?"
    }
]