[
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_f75d48))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_f75d48> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_f75d48>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#eco_f75d48",
                    "class": null,
                    "friendly_name": "Southern California Mountains and Valleys",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inEcoregion",
                    "friendly_name": "in ecoregion"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 621,
        "s-expression_simplified": "(AND foaf:Organization (JOIN fsls:inEcoregion fslp:eco_f75d48))",
        "s-expression_str": "(AND foaf:Organization (JOIN [in ecoregion] [Southern California Mountains and Valleys]))",
        "question": "Which organization is in the Southern California Mountains and Valleys ecoregion?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://vivoweb.org/ontology/core#hasCollaborator_inv (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070> .\n?x0 <http://vivoweb.org/ontology/core#hasCollaborator> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_cf5070",
                    "class": null,
                    "friendly_name": "Non-profit",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#hasCollaborator",
                    "friendly_name": "has partner"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 113,
        "s-expression_simplified": "(AND foaf:Organization (JOIN core:hasCollaborator_inv (JOIN org:classification fslp:oty_cf5070)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [has partner] (JOIN [organization type] [Non-profit])))",
        "question": "Which organizations have a non-profit organization as a partner?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0084)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0084> .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0084>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0084",
                    "class": null,
                    "friendly_name": "Energy Infrastructure",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureDownstream",
                    "friendly_name": "downstream infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesPurpose",
                    "friendly_name": "purpose of infrastructure"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 429,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:infrastructureDownstream_inv (JOIN fsls:issuesPurpose https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0084)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [is downstream infrastructure of] (JOIN [purpose of infrastructure] [Energy Infrastructure])))",
        "question": "What infrastructure is downstream of infrastructure that is purposed for Energy Infrastructure?"
    },
    {
        "s-expression": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q109709))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q109709> .\n?x a <http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates> .\nFILTER (?x != <http://www.wikidata.org/entity/Q109709>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q109709",
                    "class": null,
                    "friendly_name": "Yolo County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "class": "http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 110,
        "s-expression_simplified": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (JOIN fsls:inCounty http://www.wikidata.org/entity/Q109709))",
        "s-expression_str": "(AND http://www.sdsconsortium.org/schemas/sds-okn.owl#BestPracticesAndMandates (JOIN [in county] [Yolo County]))",
        "question": "What best practices and mandates are in Yolo County?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_fceff6",
                    "class": null,
                    "friendly_name": "Local Government",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 871,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:classification fslp:oty_fceff6))",
        "s-expression_str": "(AND foaf:Organization (JOIN [organization type] [Local Government]))",
        "question": "Which organizations are classified as local government?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_7adb83) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_7adb83> <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_7adb83>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac",
                    "class": null,
                    "friendly_name": "use case: Sacramento",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#prj_7adb83",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": "Lower Elkhorn Basin Levee Setback Project",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase",
                    "friendly_name": null
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 6,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:affiliatedOrganization_inv fslp:prj_7adb83) (JOIN fsls:usecase fsls:usecaseSac)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [participate in] [Lower Elkhorn Basin Levee Setback Project]) (JOIN fsls:usecase [use case: Sacramento])))",
        "question": "Which organization participates in the Lower Elkhorn Basin Levee Setback Project and uses the use case related to Sacramento?"
    },
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesOther https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0167)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesOther> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0167> .\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0167>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0167",
                    "class": null,
                    "friendly_name": "Land Fragmentation",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#issuesOther",
                    "friendly_name": "related issue"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:infrastructureIntersect_inv (JOIN fsls:issuesOther https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0167)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [intersecting infrastructure] (JOIN [related issue] [Land Fragmentation])))",
        "question": "What infrastructure intersects with infrastructure related to the issue of Land Fragmentation?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://purl.org/dc/terms/isPartOf_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_f0393a))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_f0393a> <http://purl.org/dc/terms/isPartOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_f0393a>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_f0393a",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "U.S. Bureau of Reclamation",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN dcterms:isPartOf_inv fslp:org_f0393a))",
        "s-expression_str": "(AND foaf:Organization (JOIN [contain] [U.S. Bureau of Reclamation]))",
        "question": "Which organization contains the U.S. Bureau of Reclamation?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Person (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239 https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0154))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0154> .\n?x a <http://xmlns.com/foaf/0.1/Person> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0154>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0154",
                    "class": null,
                    "friendly_name": "Invasive Species",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Person",
                    "class": "http://xmlns.com/foaf/0.1/Person",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#FSI_000239",
                    "friendly_name": "related sustainability issue"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 8,
        "s-expression_simplified": "(AND foaf:Person (JOIN fsls:FSI_000239 https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsourceindiv.rdf#CI0154))",
        "s-expression_str": "(AND foaf:Person (JOIN [related sustainability issue] [Invasive Species]))",
        "question": "Which person is associated with the sustainability issue of invasive species?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://purl.org/dc/terms/isPartOf_inv (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_207378) (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_207378> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager> ?x0 .\n?x0 <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41> .\n?x0 <http://purl.org/dc/terms/isPartOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_207378>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41",
                    "class": null,
                    "friendly_name": "Federal Government",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_207378",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Keswick Dam",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgManager",
                    "friendly_name": "organization manager"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN dcterms:isPartOf_inv (AND (JOIN fsls:orgManager_inv fslp:inf_207378) (JOIN org:classification fslp:oty_bc6b41))))",
        "s-expression_str": "(AND foaf:Organization (JOIN [contain] (AND (JOIN [manage] [Keswick Dam]) (JOIN [organization type] [Federal Government]))))",
        "question": "Which organization contains another organization that manages Keswick Dam and is of the type Federal Government?"
    }
]