[
    {
        "s-expression": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_a3463b) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity 1547 AF)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_a3463b> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity> \"1547 AF\" .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_a3463b>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "1547 AF",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#inf_a3463b",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": "Huntington-Pitman-Shaver Conduit",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureUpstream",
                    "friendly_name": "upstream infrastructure"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#hasCapacity",
                    "friendly_name": "capacity"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN fsls:infrastructureUpstream fslp:inf_a3463b) (JOIN fsls:hasCapacity 1547 AF)))",
        "s-expression_str": "(AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (AND (JOIN [upstream infrastructure] [Huntington-Pitman-Shaver Conduit]) (JOIN [capacity] 1547 AF)))",
        "question": "What infrastructure is upstream of the Huntington-Pitman-Shaver Conduit and has a capacity of 1547 Acre-Feet?"
    },
    {
        "s-expression": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner (JOIN http://www.w3.org/ns/org#classification https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41)))))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x0 <http://www.w3.org/ns/org#classification> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41> .\n?x1 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner> ?x0 .\n?x1 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect> ?x .\n?x a <https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#oty_bc6b41",
                    "class": null,
                    "friendly_name": "Federal Government",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "class": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 3,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#infrastructureIntersect",
                    "friendly_name": "intersecting infrastructure"
                },
                {
                    "start": 1,
                    "end": 2,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#orgOwner",
                    "friendly_name": "organization owner"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/ns/org#classification",
                    "friendly_name": "organization type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "45",
        "s-expression_simplified": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN fsls:infrastructureIntersect_inv (JOIN fsls:orgOwner (JOIN org:classification fslp:oty_bc6b41)))))",
        "s-expression_str": "(COUNT (AND https://raw.githubusercontent.com/adhollander/FSLschemas/main/sustsource.owl#Infrastructure (JOIN [intersecting infrastructure] (JOIN [organization owner] (JOIN [organization type] [Federal Government])))))",
        "question": "How many infrastructures intersect with those owned by organizations of the type Federal Government?"
    },
    {
        "s-expression": "(COUNT (AND http://vivoweb.org/ontology/core#Dataset (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007 (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q108101))))",
        "sparql": "SELECT (COUNT(DISTINCT ?x) AS ?count)\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q108101> .\n?x <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Dataset> .\nFILTER (?x != <http://www.wikidata.org/entity/Q108101>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q108101",
                    "class": null,
                    "friendly_name": "San Mateo County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Dataset",
                    "class": "http://vivoweb.org/ontology/core#Dataset",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "count"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "function": "COUNT",
        "answer": "10",
        "s-expression_simplified": "(COUNT (AND core:Dataset (JOIN frbrer:P2007 (JOIN fsls:inCounty http://www.wikidata.org/entity/Q108101))))",
        "s-expression_str": "(COUNT (AND core:Dataset (JOIN [was created by] (JOIN [in county] [San Mateo County]))))",
        "question": "How many datasets were created by entities in San Mateo County?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Program (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac> .\n?x <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Program> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecaseSac",
                    "class": null,
                    "friendly_name": "use case: Sacramento",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Program",
                    "class": "http://vivoweb.org/ontology/core#Program",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#usecase",
                    "friendly_name": null
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 45,
        "s-expression_simplified": "(AND core:Program (JOIN core:affiliatedOrganization (JOIN fsls:usecase fsls:usecaseSac)))",
        "s-expression_str": "(AND core:Program (JOIN [partner organization] (JOIN fsls:usecase [use case: Sacramento])))",
        "question": "Which program is partnered with an organization that uses the use case from Sacramento?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://purl.org/dc/terms/isPartOf_inv https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_77f9cc))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_77f9cc> <http://purl.org/dc/terms/isPartOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_77f9cc>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_77f9cc",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "UCSF Center for Climate, Health, and Equity",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 1,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN dcterms:isPartOf_inv fslp:org_77f9cc))",
        "s-expression_str": "(AND foaf:Organization (JOIN [contain] [UCSF Center for Climate, Health, and Equity]))",
        "question": "Which organization contains the UCSF Center for Climate, Health, and Equity?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Project (JOIN http://vivoweb.org/ontology/core#affiliatedOrganization (AND (JOIN http://purl.org/dc/terms/isPartOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_b186fd) (JOIN http://www.w3.org/2004/02/skos/core#altLabel BCDC))))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://purl.org/dc/terms/isPartOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_b186fd> .\n?x0 <http://www.w3.org/2004/02/skos/core#altLabel> \"BCDC\" .\n?x <http://vivoweb.org/ontology/core#affiliatedOrganization> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Project> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_b186fd>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "BCDC",
                    "class": null,
                    "friendly_name": null,
                    "node_type": "literal",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://vivoweb.org/ontology/core#Project",
                    "class": "http://vivoweb.org/ontology/core#Project",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 3,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_b186fd",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "California Natural Resources Agency",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#affiliatedOrganization",
                    "friendly_name": "partner organization"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "http://purl.org/dc/terms/isPartOf",
                    "friendly_name": "is part of"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "http://www.w3.org/2004/02/skos/core#altLabel",
                    "friendly_name": "alias"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 3,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND core:Project (JOIN core:affiliatedOrganization (AND (JOIN dcterms:isPartOf fslp:org_b186fd) (JOIN skos:altLabel BCDC))))",
        "s-expression_str": "(AND core:Project (JOIN [partner organization] (AND (JOIN [is part of] [California Natural Resources Agency]) (JOIN [alias] BCDC))))",
        "question": "Which project has a partner organization that is part of the California Natural Resources Agency and is also known as BCDC?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://www.w3.org/ns/org#memberOf_inv (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#habitatType https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#whr_VRI)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#habitatType> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#whr_VRI> .\n?x0 <http://www.w3.org/ns/org#memberOf> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#whr_VRI>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#whr_VRI",
                    "class": null,
                    "friendly_name": "VRI",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#habitatType",
                    "friendly_name": "habitat type"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 4,
        "s-expression_simplified": "(AND foaf:Organization (JOIN org:memberOf_inv (JOIN fsls:habitatType fslp:whr_VRI)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [has member] (JOIN [habitat type] [VRI])))",
        "question": "Which organization has a member that is associated with the habitat type VRI?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (JOIN http://vivoweb.org/ontology/core#hasCollaborator_inv (JOIN http://www.w3.org/ns/org#memberOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_6e065b)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://www.w3.org/ns/org#memberOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_6e065b> .\n?x0 <http://vivoweb.org/ontology/core#hasCollaborator> ?x .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_6e065b>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_6e065b",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "Central Valley Joint Venture",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#hasCollaborator",
                    "friendly_name": "has partner"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (JOIN core:hasCollaborator_inv (JOIN org:memberOf fslp:org_6e065b)))",
        "s-expression_str": "(AND foaf:Organization (JOIN [has partner] (JOIN [is member of] [Central Valley Joint Venture])))",
        "question": "Which organization has a partner that is a member of the Central Valley Joint Venture?"
    },
    {
        "s-expression": "(AND http://xmlns.com/foaf/0.1/Organization (AND (JOIN http://vivoweb.org/ontology/core#hasCollaborator https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_1b1125) (JOIN https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty http://www.wikidata.org/entity/Q108093)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x <http://vivoweb.org/ontology/core#hasCollaborator> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_1b1125> .\n?x <https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty> <http://www.wikidata.org/entity/Q108093> .\n?x a <http://xmlns.com/foaf/0.1/Organization> .\nFILTER (?x != <http://www.wikidata.org/entity/Q108093>)\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_1b1125>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://www.wikidata.org/entity/Q108093",
                    "class": null,
                    "friendly_name": "El Dorado County",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_1b1125",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "Defenders of Wildlife",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://vivoweb.org/ontology/core#hasCollaborator",
                    "friendly_name": "has partner"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/fsisupp.owl#inCounty",
                    "friendly_name": "in county"
                }
            ]
        },
        "num_entity": 2,
        "num_relation": 2,
        "numerical": false,
        "#results": 1,
        "s-expression_simplified": "(AND foaf:Organization (AND (JOIN core:hasCollaborator fslp:org_1b1125) (JOIN fsls:inCounty http://www.wikidata.org/entity/Q108093)))",
        "s-expression_str": "(AND foaf:Organization (AND (JOIN [has partner] [Defenders of Wildlife]) (JOIN [in county] [El Dorado County])))",
        "question": "Which organization has Defenders of Wildlife as a partner and is located in El Dorado County?"
    },
    {
        "s-expression": "(AND http://vivoweb.org/ontology/core#Dataset (JOIN http://iflastandards.info/ns/fr/frbr/frbrer/P2007 (JOIN http://www.w3.org/ns/org#memberOf https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4a4073)))",
        "sparql": "SELECT DISTINCT ?x\nWHERE {\n?x0 <http://www.w3.org/ns/org#memberOf> <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4a4073> .\n?x <http://iflastandards.info/ns/fr/frbr/frbrer/P2007> ?x0 .\n?x a <http://vivoweb.org/ontology/core#Dataset> .\nFILTER (?x != <https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4a4073>)\n}",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "id": "http://vivoweb.org/ontology/core#Dataset",
                    "class": "http://vivoweb.org/ontology/core#Dataset",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 1,
                    "function": "none"
                },
                {
                    "nid": 1,
                    "id": "http://xmlns.com/foaf/0.1/Organization",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": null,
                    "node_type": "class",
                    "question_node": 0,
                    "function": "none"
                },
                {
                    "nid": 2,
                    "id": "https://raw.githubusercontent.com/adhollander/FSLschemas/main/CA_PPODterms.ttl#org_4a4073",
                    "class": "http://xmlns.com/foaf/0.1/Organization",
                    "friendly_name": "California Biodiversity Council",
                    "node_type": "entity",
                    "question_node": 0,
                    "function": "none"
                }
            ],
            "edges": [
                {
                    "start": 0,
                    "end": 1,
                    "relation": "http://iflastandards.info/ns/fr/frbr/frbrer/P2007",
                    "friendly_name": "was created by"
                },
                {
                    "start": 1,
                    "end": 2,
                    "relation": "http://www.w3.org/ns/org#memberOf",
                    "friendly_name": "is member of"
                }
            ]
        },
        "num_entity": 1,
        "num_relation": 2,
        "numerical": false,
        "#results": 4,
        "s-expression_simplified": "(AND core:Dataset (JOIN frbrer:P2007 (JOIN org:memberOf fslp:org_4a4073)))",
        "s-expression_str": "(AND core:Dataset (JOIN [was created by] (JOIN [is member of] [California Biodiversity Council])))",
        "question": "Which dataset was created by a member of the California Biodiversity Council?"
    }
]